---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarContainerItem
source: html/764f647c-9c3e-b971-1c44-b63f756e1448.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem

Provides implementation for Rebar stored in RebarContainer.

## Syntax (C#)
```csharp
public class RebarContainerItem : IDisposable
```